### Homework 1 (due 08 Sep 2024)

In [465]:
# File: HWK1.ipynb

# Student Name: Dylan Lam

# UT EID: DXL85

# Student Name: Eric Nguyen

# UT EID:

# Student Name:

# UT EID:

# Date Created: 9/5/2024

# Date Last Modified: 9/7/2024

In [466]:
# import libraries
import numpy as np
import pandas as pd

In [467]:
# read data file 'Canada.xlsx' and create a data frame
df = pd.read_excel ('Canada.xlsx', sheet_name = 'Canada by Citizenship (2)')

In [468]:
# get the size of the dataframe (rows, cols)
df.shape

(195, 43)

In [469]:
# get the head of the dataframe
df.head()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Immigrants,Foreigners,Afghanistan,935,Asia,5501,Southern Asia,902,Developing regions,16,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Immigrants,Foreigners,Albania,908,Europe,925,Southern Europe,901,Developed regions,1,...,1450,1223,856,702,560,716,561,539,620,603
2,Immigrants,Foreigners,Algeria,903,Africa,912,Northern Africa,902,Developing regions,80,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,Immigrants,Foreigners,American Samoa,909,Oceania,957,Polynesia,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
4,Immigrants,Foreigners,Andorra,908,Europe,925,Southern Europe,901,Developed regions,0,...,0,0,1,1,0,0,0,0,1,1

In [470]:
# get the tail of the dataframe
df.tail()

,Type,Coverage,OdName,AREA,AreaName,REG,RegName,DEV,DevName,1980,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
190,Immigrants,Foreigners,Viet Nam,935,Asia,920,South-Eastern Asia,902,Developing regions,1191,...,1816,1852,3153,2574,1784,2171,1942,1723,1731,2112
191,Immigrants,Foreigners,Western Sahara,903,Africa,912,Northern Africa,902,Developing regions,0,...,0,0,1,0,0,0,0,0,0,0
192,Immigrants,Foreigners,Yemen,935,Asia,922,Western Asia,902,Developing regions,1,...,124,161,140,122,133,128,211,160,174,217
193,Immigrants,Foreigners,Zambia,903,Africa,910,Eastern Africa,902,Developing regions,11,...,56,91,77,71,64,60,102,69,46,59
194,Immigrants,Foreigners,Zimbabwe,903,Africa,910,Eastern Africa,902,Developing regions,72,...,1450,615,454,663,611,508,494,434,437,407

In [471]:
# get the information on the dataframe
df.info (verbose = False)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Columns: 43 entries, Type to 2013
dtypes: int64(37), object(6)
memory usage: 65.6+ KB

In [472]:
# get a description of the dataframe
df.describe()

,AREA,REG,DEV,1980,1981,1982,1983,1984,1985,1986,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
count,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,...,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000,195.000000
mean,912.764103,1249.015385,901.753846,508.394872,566.989744,534.723077,387.435897,376.497436,358.861538,441.271795,...,1190.169231,1320.292308,1266.958974,1191.820513,1246.394872,1275.733333,1420.287179,1262.533333,1313.958974,1320.702564
std,13.082835,1185.526885,0.431878,1949.588546,2152.643752,1866.997511,1204.333597,1198.246371,1079.309600,1225.576630,...,3710.505369,4425.957828,3926.717747,3443.542409,3694.573544,3829.630424,4462.946328,4030.084313,4247.555161,4237.951988
min,903.000000,905.000000,901.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,903.000000,914.000000,902.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.500000,...,19.000000,28.500000,25.000000,31.000000,31.000000,36.000000,40.500000,37.500000,42.500000,45.000000
50%,908.000000,922.000000,902.000000,13.000000,10.000000,11.000000,12.000000,13.000000,17.000000,18.000000,...,191.000000,210.000000,218.000000,198.000000,205.000000,214.000000,211.000000,179.000000,233.000000,213.000000
75%,922.000000,925.500000,902.000000,251.500000,295.500000,275.000000,173.000000,181.000000,197.000000,254.000000,...,756.500000,832.000000,842.000000,899.000000,934.500000,888.000000,932.000000,772.000000,783.000000,796.000000
max,935.000000,5501.000000,902.000000,22045.000000,24796.000000,20620.000000,10015.000000,10170.000000,9564.000000,9470.000000,...,36619.000000,42584.000000,33848.000000,28742.000000,30037.000000,29622.000000,38617.000000,36765.000000,34315.000000,34129.000000

In [473]:
# get a list of column headers
df.columns

Index([    'Type', 'Coverage',   'OdName',     'AREA', 'AreaName',      'REG',
        'RegName',      'DEV',  'DevName',       1980,       1981,       1982,
             1983,       1984,       1985,       1986,       1987,       1988,
             1989,       1990,       1991,       1992,       1993,       1994,
             1995,       1996,       1997,       1998,       1999,       2000,
             2001,       2002,       2003,       2004,       2005,       2006,
             2007,       2008,       2009,       2010,       2011,       2012,
             2013],
      dtype='object')

In [474]:
# get a list of indices
df.index

RangeIndex(start=0, stop=195, step=1)

In [475]:
# drop unnecessary columns
# in pandas: rows is axis = 0 and columns is axis = 1
df.drop (['Type', 'Coverage', 'AREA', 'REG', 'DEV', 'DevName'], axis = 1, inplace = True)

In [476]:
# check the deletion of unnecessary columns
df.head()

,OdName,AreaName,RegName,1980,1981,1982,1983,1984,1985,1986,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,Asia,Southern Asia,16,39,39,47,71,340,496,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Albania,Europe,Southern Europe,1,0,0,0,0,0,1,...,1450,1223,856,702,560,716,561,539,620,603
2,Algeria,Africa,Northern Africa,80,67,71,69,63,44,69,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,American Samoa,Oceania,Polynesia,0,1,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4,Andorra,Europe,Southern Europe,0,0,0,0,0,0,2,...,0,0,1,1,0,0,0,0,1,1

In [477]:
# rename column names
df.rename (columns = {'OdName':'Country', 'AreaName':'Continent', 'RegName': 'Region'}, inplace = True)

In [478]:
# check if columns were renamed
df.head()

,Country,Continent,Region,1980,1981,1982,1983,1984,1985,1986,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,Afghanistan,Asia,Southern Asia,16,39,39,47,71,340,496,...,2978,3436,3009,2652,2111,1746,1758,2203,2635,2004
1,Albania,Europe,Southern Europe,1,0,0,0,0,0,1,...,1450,1223,856,702,560,716,561,539,620,603
2,Algeria,Africa,Northern Africa,80,67,71,69,63,44,69,...,3616,3626,4807,3623,4005,5393,4752,4325,3774,4331
3,American Samoa,Oceania,Polynesia,0,1,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
4,Andorra,Europe,Southern Europe,0,0,0,0,0,0,2,...,0,0,1,1,0,0,0,0,1,1

In [479]:
# add a column at the end giving the total number of immigrants for each country
df['Total'] = df.sum (axis = 1, numeric_only = True)

In [480]:
# check if column was added
df.head()

,Country,Continent,Region,1980,1981,1982,1983,1984,1985,1986,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
0,Afghanistan,Asia,Southern Asia,16,39,39,47,71,340,496,...,3436,3009,2652,2111,1746,1758,2203,2635,2004,58639
1,Albania,Europe,Southern Europe,1,0,0,0,0,0,1,...,1223,856,702,560,716,561,539,620,603,15699
2,Algeria,Africa,Northern Africa,80,67,71,69,63,44,69,...,3626,4807,3623,4005,5393,4752,4325,3774,4331,69439
3,American Samoa,Oceania,Polynesia,0,1,0,0,0,0,0,...,0,1,0,0,0,0,0,0,0,6
4,Andorra,Europe,Southern Europe,0,0,0,0,0,0,2,...,0,1,1,0,0,0,0,1,1,15

In [481]:
# change the index to be the name of the country
df.set_index ('Country', inplace = True)

In [482]:
# check if the index was changed
df.head()

,Continent,Region,1980,1981,1982,1983,1984,1985,1986,1987,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
Country,,,,,,,,,,,,,,,,,,,,,
Afghanistan,Asia,Southern Asia,16,39,39,47,71,340,496,741,...,3436,3009,2652,2111,1746,1758,2203,2635,2004,58639
Albania,Europe,Southern Europe,1,0,0,0,0,0,1,2,...,1223,856,702,560,716,561,539,620,603,15699
Algeria,Africa,Northern Africa,80,67,71,69,63,44,69,132,...,3626,4807,3623,4005,5393,4752,4325,3774,4331,69439
American Samoa,Oceania,Polynesia,0,1,0,0,0,0,0,1,...,0,1,0,0,0,0,0,0,0,6
Andorra,Europe,Southern Europe,0,0,0,0,0,0,2,0,...,0,1,1,0,0,0,0,1,1,15

In [483]:
# get a slice of the data 
df.loc ['Costa Rica']

Continent    Latin America and the Caribbean
Region                       Central America
1980                                      28
1981                                      35
1982                                      42
1983                                      51
1984                                      75
1985                                     113
1986                                      79
1987                                     116
1988                                     104
1989                                      92
1990                                      99
1991                                     156
1992                                     216
1993                                     184
1994                                      83
1995                                      89
1996                                     118
1997                                     135
1998                                     103
1999                                     100
2000                                     106
2001                                     134
2002                                     106
2003                                     105
2004                                     165
2005                                     188
2006                                     279
2007                                     281
2008                                     246
2009                                     217
2010                                     190
2011                                     149
2012                                     183
2013                                     122
Total                                   4489
Name: Costa Rica, dtype: object

In [484]:
# get data for only certain years
df.loc ['Greece', [1981, 1988, 1994, 1999]]

1981    953
1988    564
1994    275
1999    149
Name: Greece, dtype: object

In [485]:
# convert column names into strings
df.columns = list(map (str, df.columns))

In [486]:
# create a condition
cond = (df['Continent'] == 'Asia')
print (cond)

Country
Afghanistan        True
Albania           False
Algeria           False
American Samoa    False
Andorra           False
                  ...
Viet Nam           True
Western Sahara    False
Yemen              True
Zambia            False
Zimbabwe          False
Name: Continent, Length: 195, dtype: bool

In [487]:
# create a compound condition using Boolean operators: ~ (not), & (and), | (or)
cond = df[(df['Continent'] == 'Asia') & (df['Region'] == 'Southern Asia')]
print (cond)

                           Continent         Region  1980  1981  1982  1983  \
Country
Afghanistan                     Asia  Southern Asia    16    39    39    47
Bangladesh                      Asia  Southern Asia    83    84    86    81
Bhutan                          Asia  Southern Asia     0     0     0     0
India                           Asia  Southern Asia  8880  8670  8147  7338
Iran (Islamic Republic of)      Asia  Southern Asia  1172  1429  1822  1592
Maldives                        Asia  Southern Asia     0     0     0     1
Nepal                           Asia  Southern Asia     1     1     6     1
Pakistan                        Asia  Southern Asia   978   972  1201   900
Sri Lanka                       Asia  Southern Asia   185   371   290   197

                            1984  1985  1986   1987  ...   2005   2006   2007  \
Country                                              ...
Afghanistan                   71   340   496    741  ...   3436   3009   2652
Bangladesh                    98    92   486    503  ...   4171   4014   2897
Bhutan                         1     0     0      0  ...      5     10      7
India                       5704  4211  7150  10189  ...  36210  33848  28742
Iran (Islamic Republic of)  1977  1648  1794   2989  ...   5837   7480   6974
Maldives                       0     0     0      0  ...      0      0      2
Nepal                          2     4    13      6  ...    607    540    511
Pakistan                     668   514   691   1072  ...  14314  13127  10124
Sri Lanka                   1086   845  1838   4447  ...   4930   4714   4123

                             2008   2009   2010   2011   2012   2013   Total
Country
Afghanistan                  2111   1746   1758   2203   2635   2004   58639
Bangladesh                   2939   2104   4721   2694   2640   3789   65568
Bhutan                         36    865   1464   1879   1075    487    5876
India                       28261  29456  34235  27509  30933  33087  691904
Iran (Islamic Republic of)   6475   6580   7477   7479   7534  11291  175923
Maldives                        1      7      4      3      1      1      30
Nepal                         581    561   1392   1129   1185   1308   10222
Pakistan                     8994   7217   6811   7468  11227  12603  241600
Sri Lanka                    4756   4547   4422   3309   3338   2394  148358

[9 rows x 37 columns]

**Q. 0 (0 points)**
Some useful functions to make your life easier in this assignment:
* https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html
* https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html
* https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html

## **Q. 1 (20 points)**  
Add a row at the bottom of the dataframe that gives the total immigration for each year from 1980 to 2013.

In [488]:
df.tail()

,Continent,Region,1980,1981,1982,1983,1984,1985,1986,1987,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
Country,,,,,,,,,,,,,,,,,,,,,
Viet Nam,Asia,South-Eastern Asia,1191,1829,2162,3404,7583,5907,2741,1406,...,1852,3153,2574,1784,2171,1942,1723,1731,2112,97146
Western Sahara,Africa,Northern Africa,0,0,0,0,0,0,0,0,...,0,1,0,0,0,0,0,0,0,2
Yemen,Asia,Western Asia,1,2,1,6,0,18,7,12,...,161,140,122,133,128,211,160,174,217,2985
Zambia,Africa,Eastern Africa,11,17,11,7,16,9,15,23,...,91,77,71,64,60,102,69,46,59,1677
Zimbabwe,Africa,Eastern Africa,72,114,102,44,32,29,43,68,...,615,454,663,611,508,494,434,437,407,8598

In [489]:
# add a column at the end giving the total number of immigrants for each country
df.loc['Total Immigration'] = df.sum (axis = 0, numeric_only = True)

In [490]:
df.tail(1)

,Continent,Region,1980,1981,1982,1983,1984,1985,1986,1987,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,Total
Country,,,,,,,,,,,,,,,,,,,,,
Total Immigration,NaN,NaN,99137.0,110563.0,104271.0,75550.0,73417.0,69978.0,86048.0,134771.0,...,257457.0,247057.0,232405.0,243047.0,248768.0,276956.0,246194.0,256222.0,257537.0,6409153.0

In [491]:
df.loc['Total Immigration', df.columns].head()

Continent         NaN
Region            NaN
1980          99137.0
1981         110563.0
1982         104271.0
Name: Total Immigration, dtype: object

## **Q. 2 (20 points)**  
For each year, find the maximum number of immigrants and the country that had the maximum number of immigrants. Create a new dataframe having three columns - year, country, and number of immigrants. For a given year, if there are two or more countries having the same maximum number of immigrants, then choose that country that comes first in alphabetical order.

In [494]:
df = df.drop('Total Immigration', axis = 0)

country_list = []
year_list = []
count_list = []

for year in list(map(str,range(1980,2014))):
    country = df[year].sort_index().nlargest(1).index.values
    count = (df.loc[country,year].values)[0]
    country_list.append(country[0])
    year_list.append(year)
    count_list.append(count)

TypeError: 'list' object is not callable

In [ ]:
# Double check if sort_index method allows for choosing of country that's first in alpha order
df['1995'].sort_index().nlargest()

Country
United Kingdom of Great Britain and Northern Ireland    30145.0
India                                                   18489.0
Philippines                                             15864.0
China                                                   14398.0
Sri Lanka                                                9368.0
Name: 1995, dtype: float64

In [ ]:
df2 = pd.DataFrame(columns=['Country', 'Year', 'Max Number of Immigrants'])
df2['Country'] = country_list
df2['Year'] = year_list
df2['Max Number of Immigrants'] = count_list
df2.set_index('Country', inplace=True)
df2.head()

,Year,Max Number of Immigrants
Country,,
United Kingdom of Great Britain and Northern Ireland,1980,22045.0
United Kingdom of Great Britain and Northern Ireland,1981,24796.0
United Kingdom of Great Britain and Northern Ireland,1982,20620.0
United Kingdom of Great Britain and Northern Ireland,1983,10015.0
United Kingdom of Great Britain and Northern Ireland,1984,10170.0

## **Q. 3 (20 points)**   
For each year find the total, mean, standard deviation, maximum, minimum, and range (max - min). Create a new dataframe having columns - year, total, mean, standard deviation, maximum, minimum, and range.

In [ ]:
total = []
mean = []
std = []
max = []
min = []
range = []



for year in list(map(str,range(1980,2014))):
    total.append(df[year].sum(numeric_only=True))
    mean.append(df[year].mean())
    std.append(df[year].std())
    max.append(df[year].max())
    min.append(df[year].min())
    range.append(df[year].max() - df[year].min())

TypeError: 'list' object is not callable

In [ ]:
df3 = pd.DataFrame(columns=['Total', 'Mean', 'Standard Deviation', 'Max', 'Min', 'Range'])
df3['Total'] = total
df3['Mean'] = mean
df3['Standard Deviation'] = std
df3['Max'] = std
df3['Min'] = std
df3['Range'] = std
df3.set_index('Country', inplace=True)
df3.head()

## **Q. 4 (20 points)**   
For the Scandinavian countries - Denmark, Norway, and Sweden - print the name of the country and the total immigration for each of these countries.

## **Q. 5 (20 points)**    
Sum the immigration for all the years from the following continents - Africa, Asia, Europe, Latin America and  the Caribbean, Northern America, and Oceania. Print the name of the continent and the total immigration.